# Newton Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Newton Property
SymbolTypeId Class See Also
---
Symbol N, indicating unit Newtons.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Newton { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Newton As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Newton {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace